# CodeCheckingParameterServiceData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CodeCheckingParameterServiceData Class
Members See Also
---
The data needed by code checking server to perform code checking.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class CodeCheckingParameterServiceData : IDisposable
```

Visual Basic
---
```text
Public Class CodeCheckingParameterServiceData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class CodeCheckingParameterServiceData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..CodeCheckingParameterServiceData
# See Also
CodeCheckingParameterServiceData Members
Autodesk.Revit.DB.Structure Namespace